Dysd12/League-Minion-Project/TX STM32/src/nrf.c
/**
 * Author: Daniel Yeo
 * Date: 7/17/2026
 * File: nrf.c
 * Desc: Implementation file for the nRF24L01+ module. 
 */

#include <stm32l432xx.h>
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stddef.h>
#include "nrf.h"
#include "delay.h"
#include "spi.h"
#include "gpio.h"

static void nRF24_set_ce(bool ce) {
    GPIO_write(nRF24_CE, ce);
}

static void nRF24_set_csn(bool csn) {
    GPIO_write(nRF24_CSN, csn);
}

static void nRF24_write(uint8_t cmd, const uint8_t *data, uint8_t size) {
    cmd |= 0x20;
    nRF24_set_csn(0);
    SPI1_transmit(&cmd, 1);
    SPI1_transmit(data, size);
    delay_ms(1); // Need delay to ensure the nRF24 has time to process the command
    nRF24_set_csn(1);
}

static void nRF24_read(uint8_t cmd, uint8_t *data, uint8_t size) {
    nRF24_set_csn(0);
    SPI1_transmit(&cmd, 1);
    SPI1_flush_rx();
    SPI1_receive(data, size);
    delay_ms(1); // Need delay to ensure the nRF24 has time to process the command
    nRF24_set_csn(1);
}

static void nRF24_cmd(uint8_t cmd) {
    nRF24_set_csn(0);
    SPI1_transmit(&cmd, 1);
    delay_ms(1);
    nRF24_set_csn(1);
}

static void nRF24_print_registers(bool tx_mode) {
    if(tx_mode) {
        printf("=== TX MODE ===\n");
    } else {
        printf("=== RX MODE ===\n");
    }
    uint8_t val;
    uint8_t addr[5] = {0};
    nRF24_read(CONFIG, &val, 1);
    printf("nRF24 CONFIG:      0x%02X\n", val);
    nRF24_read(EN_AA, &val, 1);
    printf("nRF24 EN_AA:       0x%02X\n", val);
    nRF24_read(EN_RXADDR, &val, 1);
    printf("nRF24 EN_RXADDR:  0x%02X\n", val);
    nRF24_read(SETUP_AW, &val, 1);
    printf("nRF24 SETUP_AW:    0x%02X\n", val);
    nRF24_read(SETUP_RETR, &val, 1);
    printf("nRF24 SETUP_RETR:  0x%02X\n", val);
    nRF24_read(RF_CH, &val, 1);
    printf("nRF24 RF_CH:       0x%02X\n", val);
    nRF24_read(RF_SETUP, &val, 1);
    printf("nRF24 RF_SETUP:    0x%02X\n", val);
    nRF24_read(STATUS, &val, 1);
    printf("nRF24 STATUS:      0x%02X\n", val);
    nRF24_read(RX_ADDR_P0, addr, 5);
    printf("nRF24 RX_ADDR_P0:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_ADDR_P1, addr, 5);
    printf("nRF24 RX_ADDR_P1:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_ADDR_P2, addr, 5);
    printf("nRF24 RX_ADDR_P2:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_ADDR_P3, addr, 5);
    printf("nRF24 RX_ADDR_P3:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_ADDR_P4, addr, 5);
    printf("nRF24 RX_ADDR_P4:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_ADDR_P5, addr, 5);
    printf("nRF24 RX_ADDR_P5:  0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(TX_ADDR, addr, 5);
    printf("nRF24 TX_ADDR:     0x%02X%02X%02X%02X%02X\n", addr[4], addr[3], addr[2], addr[1], addr[0]);
    nRF24_read(RX_PW_P0, &val, 1);
    printf("nRF24 RX_PW_P0:    0x%02X\n", val);
    nRF24_read(RX_PW_P1, &val, 1);
    printf("nRF24 RX_PW_P1:    0x%02X\n", val);
    nRF24_read(RX_PW_P2, &val, 1);
    printf("nRF24 RX_PW_P2:    0x%02X\n", val);
    nRF24_read(RX_PW_P3, &val, 1);
    printf("nRF24 RX_PW_P3:    0x%02X\n", val);
    nRF24_read(RX_PW_P4, &val, 1);
    printf("nRF24 RX_PW_P4:    0x%02X\n", val);
    nRF24_read(RX_PW_P5, &val, 1);
    printf("nRF24 RX_PW_P5:    0x%02X\n", val);
    nRF24_read(FIFO_STATUS, &val, 1);
    printf("nRF24 FIFO_STATUS: 0x%02X\n", val);
}

void nRF24_init(const uint8_t *address, uint8_t channel, bool tx_mode) {
    // Initialize Nucleo pins connected to nRF24L01+ module
    delay_ms(100);
    GPIO_config_output(nRF24_CE, 0, 0);
    GPIO_config_output(nRF24_CSN, 0, 0);
    nRF24_set_ce(0);
    nRF24_set_csn(1);

    // Reset Status & Flush Buffers
    nRF24_cmd(FLUSH_TX); // Clears the TX buffer, can hold 3 packets (in this case a packet holds 2 bytes)
    nRF24_cmd(FLUSH_RX);
    nRF24_write(STATUS, (uint8_t[]){0x70}, 1); // Clear interrupts, Write 1 to clear
    // TX RX Common Configs
    nRF24_write(EN_AA,     (uint8_t[]){0x00}, 1); // Disable Auto-ACK
    nRF24_write(SETUP_AW,  (uint8_t[]){0x03}, 1); // 5-byte address width
    nRF24_write(SETUP_RETR,(uint8_t[]){0x00}, 1); // No retransmissions
    nRF24_write(RF_CH,     &channel,          1);
    nRF24_write(RF_SETUP,  (uint8_t[]){0x0E}, 1); // 2Mbps, 0dBm
    // Per TX RX Configs
    if (tx_mode) {
        nRF24_write(CONFIG,     (uint8_t[]){0x0E}, 1); // TX Mode, Power Up
        nRF24_write(TX_ADDR,    address,           5); // Set TX Target Address
    } else {
        nRF24_write(CONFIG,     (uint8_t[]){0x0F}, 1); // RX Mode, Power Up
        nRF24_write(EN_RXADDR,  (uint8_t[]){0x02}, 1); // Enable Pipe 1 Only
        nRF24_write(RX_PW_P1,   (uint8_t[]){0x02}, 1); // 2-byte payload for Pipe 1
        nRF24_write(RX_ADDR_P1, address,           5); // Set RX Pipe 1 address
        nRF24_set_ce(1);
    }
    nRF24_print_registers(tx_mode);
}

bool nRF24_transmit(const uint8_t *data) {
    // Write data to TX FIFO
    nRF24_write(W_TX_PAYLOAD, data, 2);

    nRF24_set_ce(1); // Flash CE to transmit package
    //delay_us(10);
    nRF24_set_ce(0);

    uint8_t status_reg = 0;
    nRF24_read(STATUS, &status_reg, 1);

    if (status_reg & STATUS_TX_DS) {
        nRF24_write(STATUS, (uint8_t[]){STATUS_TX_DS}, 1);
        nRF24_cmd(FLUSH_TX); // Clear TX FIFO, get rid of new data the MCU didn't have time to process
        return 1;
    }
    return 0;
}

bool nRF24_receive(uint8_t *data) {
    // Check if data is available in RX FIFO
    uint8_t status_reg = 0;
    nRF24_read(STATUS, &status_reg, 1);

    if (status_reg & STATUS_RX_DR) {
        nRF24_read(R_RX_PAYLOAD, data, 2); // Read data
        nRF24_write(STATUS, (uint8_t[]){STATUS_RX_DR}, 1); // Clear flag
        nRF24_cmd(FLUSH_RX); // Clear RX FIFO, get rid of new data the MCU didn't have time to process
        return 1;
    }
    return 0;
}